Revit 2026 API

# RepeaterCoordinatesGetCoordinate Method

---

Returns the coordinate in the given dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetCoordinate(
	int dimension
)
```
```vb
Public Function GetCoordinate (
	dimension As Integer
) As Integer
```
```cpp
public:
int GetCoordinate(
	int dimension
)
```
```fsharp
member GetCoordinate :
        dimension : int -> int
```

#### Parameters

dimension Int32
     The dimension.

#### Return Value

Int32 The coordinate.

| Exception | Condition |
| --- | --- |
| ArgumentException | The dimension is invalid for these coordinates. |
| InvalidOperationException | The coordinates must have at least one dimension. |

The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional coordinates.

#### Reference

RepeaterCoordinates Class

Autodesk.Revit.DB Namespace